Heat Transfer/testcase_multiregion/constant/heater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/heater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       100440;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       103440;
    }
    front
    {
        type            patch;
        nFaces          360;
        startFace       106440;
    }
    back
    {
        type            patch;
        nFaces          360;
        startFace       106800;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       107160;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       108360;
    }
    heater_to_water
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       109560;
        sampleMode      nearestPatchFace;
        sampleRegion    water;
        samplePatch     water_to_heater;
    }
)

// ************************************************************************* //
