Heat Transfer/testcase_multiregion/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       263100;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       266100;
    }
    front
    {
        type            patch;
        nFaces          900;
        startFace       269100;
    }
    back
    {
        type            patch;
        nFaces          900;
        startFace       270000;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       270900;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3000;
        startFace       273900;
    }
)

// ************************************************************************* //
