Heat Transfer/testcase_multiregion/constant/water/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/water/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            patch;
        nFaces          540;
        startFace       156660;
    }
    back
    {
        type            patch;
        nFaces          540;
        startFace       157200;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1800;
        startFace       157740;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1800;
        startFace       159540;
    }
    water_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          6000;
        startFace       161340;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_water;
    }
)

// ************************************************************************* //
