Heat Transfer/testcase_multiregion/0/water/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/water";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    front
    {
        type            fixedValue;
        value           uniform ( 0.01 0 0 );
    }
    back
    {
        type            zeroGradient;
        value           uniform ( 0 0 0 );
    }
    left
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    right
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
    water_to_heater
    {
        type            noSlip;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
