Heat Transfer/testcase_multiregion/0/water/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/water";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    front
    {
        type            fixedValue;
        value           uniform 300;
    }
    back
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    left
    {
        type            zeroGradient;
        value           uniform 300;
    }
    right
    {
        type            zeroGradient;
        value           uniform 300;
    }
    water_to_heater
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
